/* -------------------------
 * Task-3.1
 * শূন্য প্যারামিটার ওয়ালা একটা অ্যারো ফাংশন লিখবে যেটা ৮৯ রিটার্ন করবে।
------------------------- */
const getEightyNine = () => 89;
console.log(getEightyNine());

/* -------------------------
 * Task-3.2
 * এক প্যারামিটার ওয়ালা একটা অ্যারো ফাংশন ডিক্লেয়ার করবে। এই ফাংশনের কাজ হবে যে প্যারামিটার নিবে সেটাকে ৭ দিয়ে ভাগ করে ভাগফল রিটার্ন করবে।
------------------------- */
const dividedBySeven = number => number / 7;
const result1 = dividedBySeven(56);
console.log(result1);

/* -------------------------
 * Task-3.3
 * দুই, প্যারামিটার ওয়ালা একটা অ্যারো ফাংশন লিখবে। এই ফাংশনের কাজ হবে যে দুইটা প্যারামিটার ইনপুট নিবে। সেই দুইটা প্যারামিটারকে যোগ করে যোগফলকে দুই দিয়ে ভাগ করে ভাগফল রিটার্ণ করে দাও।
------------------------- */
const average = (num1, num2) => (num1 + num2) / 2;
const result2 = average(10, 20);
console.log(result2);


/* -------------------------
 * Task-3.4
 * একাধিক লাইন ওয়ালা অ্যারো ফাংশন লিখো। সেটাতে দুইটা প্যারামিটার নিবে। ওই arrow ফাংশনটা হবে অনেকগুলা লাইনের। সেখানে প্রত্যেকটা ইনপুট প্যারামিটার এর সাথে ৭ যোগ করবে তারপর যোগফল দুইটাকে আবার যোগ করবে। ক্যামনে করবে সেটা চিন্তা করে বের করার চেষ্টা করো।
------------------------- */
const multiStepCalc = (num1, num2) => {
	const first = num1 + 7;
	const second = num2 + 7;
	const output = first + second;
	return output;
}
const result3 = multiStepCalc(43, 23);
console.log(result3);
